app/services/command_service.rb

  def get_command_for(device_identifier)
    id = 0
    request = 'NONE'

    device = Device.find_by(identifier: device_identifier)
---
SELECT "devices".* FROM "devices" WHERE "devices"."identifier" = ? LIMIT ?  [["identifier", "357073294592759"], ["LIMIT", 1]]